Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: By default, system properties starting with `quarkus.` and environment variables, including those from `~/.env`, starting with `QUARKUS_`, are considered as inputs for the Gradle tasks. This means that only changes to those system properties or environment variables will cause Gradle's up-to-date to trigger a rebuild. Changes to other system properties or environment variables do not change Quarkus' Gradle task inputs and do not trigger an unnecessary rebuild.
ja_jp: デフォルトでは、 `quarkus.` で始まるシステムプロパティーと、 `QUARKUS_` で始まる環境変数 (`~/.env`からの環境変数を含む) は、Gradle タスクの入力とみなされます。つまり、これらのシステムプロパティーへの変更のみが、Gradle のリビルドをトリガーして最新を保ちます。 他のシステムプロパティーや環境変数を変更しても、Quarkus の Gradle タスク入力は変更されず、不要なリビルドがトリガーされることはありません。

source: By default, tests should just work with xref:dev-services.adoc[Dev Services], however from some use cases you may need access to the automatically configured properties in your tests.
ja_jp: デフォルトでは、テストは xref:dev-services.adoc[Dev Services] でのみ機能するはずですが、一部のユースケースでは、テストで自動的に設定されたプロパティーにアクセスする必要がある場合があります。

source: By default, tests will run on port `8081` so as not to conflict with the running application. We automatically configure RestAssured to use this port. If you want to use a different client you should use the `@TestHTTPResource` annotation to directly inject the URL of the tested application into a field on the test class. This field can be of the type `String`, `URL` or `URI`. This annotation can also be given a value for the test path. For example, if I want to test a Servlet mapped to `/myservlet` I would just add the following to my test:
ja_jp: デフォルトでは、実行中のアプリケーションと競合しないように、テストはポート `8081` で実行されます。 RestAssured は、この 8081 ポートを使用するように自動的にを設定されます。別のクライアントを使用したい場合は、 `@TestHTTPResource` アノテーションを使用して、テストされたアプリケーションの URL をテストクラスのフィールドに直接注入する必要があります。このフィールドは `String`、 `URL`、 `URI` のいずれかの型になります。このアノテーションにはテストパスの値を指定することもできます。例えば、 `/myservlet` にマップされたサーブレットをテストしたい場合、次のようにテストに追加します。

source: By default, the metrics are exported using the Prometheus format `application/openmetrics-text`, you can revert to the former format by specifying the `Accept` request header to `text/plain` (`curl -H "Accept: text/plain" localhost:8080/q/metrics/`).
ja_jp: デフォルトでは、メトリクスはPrometheusのフォーマット `application/openmetrics-text` を使用してエクスポートされます。 `Accept` リクエストヘッダを `plain/text` ( `curl -H "Accept: plain/text" localhost:8080/q/metrics/` ) に指定することで、以前のフォーマットに戻すことも可能です。

source: By default, the Ansible collection for Quarkus will install and use the OpenJDK 17 available in the Yum repositories of the target host (or the controller). If you want to use a different version of OpenJDK, define the following variable:
ja_jp: デフォルトでは、Quarkus用のAnsibleコレクションは、ターゲットホスト（またはコントローラー）のYumリポジトリで利用可能なOpenJDK 17をインストールして使用します。異なるバージョンのOpenJDKを使用したい場合は、以下の変数を定義します：

source: By default, the Cassandra client is configured to access a local Cassandra database on port 9042 (the default Cassandra port).
ja_jp: デフォルトでは、Cassandra クライアントは、ポート 9042(デフォルトの Cassandra ポート)でローカル Cassandra データベースにアクセスするように構成されています。

source: By default, the JaCoCo data will be saved in the `target/jacoco-quarkus.exec` file and a coverage report is generated automatically in the `target/jacoco-report` directory.
ja_jp: デフォルトでは、JaCoCo データは `target/jacoco-quarkus.exec` ファイルに保存され、カバレッジレポートは `target/jacoco-report` ディレクトリに自動的に生成されます。

source: By default, the Keycloak page can be used to support the development of a xref:security-oidc-bearer-token-authentication.adoc[Quarkus OIDC service application].
ja_jp: デフォルトでは、Keycloak ページを使用して、xref:security-oidc-bearer-token-authentication.adoc[Quarkus OIDC サービスアプリケーション] の開発をサポートできます。

source: By default, the Keycloak page can be used to support the development of a xref:security-openid-connect.adoc[Quarkus OIDC service application].
ja_jp: デフォルトでは、Keycloak ページを使用して、xref:security-openid-connect.adoc[Quarkus OIDC サービスアプリケーション] の開発をサポートできます。

source: By default, the Kotlin code generation is enabled if the dependency `io.quarkus:quarkus-kotlin` is present.
ja_jp: デフォルトでは、依存関係 `io.quarkus:quarkus-kotlin` が存在する場合、Kotlin コード生成が有効になります。

source: By default, the Kubernetes resources do not contain readiness and liveness probes in the generated `Deployment`. Adding them however is just a matter of adding the SmallRye Health extension like so:
ja_jp: デフォルトでは、Kubernetesリソースは、生成された `Deployment` の中に readiness と liveness のプローブを含みません。しかし、これらを追加するには、以下のように SmallRye Health エクステンションを追加するだけです。

source: By default, the Kubernetes resources do not contain readiness and liveness probes. To add them, import the SmallRye Health extension to your build file:
ja_jp: デフォルトでは、Kubernetesリソースにはreadiness プローブとliveness プローブが含まれていません。これらを追加するには、ビルドファイルにSmallRye Healthエクステンションをインポートします：

source: By default, the Kubernetes resources do not contain readiness and liveness probes. To add them, import the Smallrye Health extension to your build file:
ja_jp: デフォルトでは、Kubernetes リソースに readiness プローブと liveness プローブは含まれていません。これらを追加するには、Smalllye Health エクステンションをビルドファイルにインポートします。

source: By default, the Maven plugin picks up compiler flags to pass to `javac` from `maven-compiler-plugin`.
ja_jp: デフォルトでは、Maven プラグインは `maven-compiler-plugin` から `javac` に渡すコンパイラフラグをピックアップします。

source: By default, the OIDC client refreshes the token during the current request when it detects that the token has expired, or is nearly expired if the xref:#quarkus-oidc-client_quarkus-oidc-client-refresh-token-time-skew[refresh token time skew] is configured. Performance-critical applications might want to avoid waiting for a possible token refresh during incoming requests and configure an asynchronous token refresh instead.
ja_jp: デフォルトでは、OIDC クライアントは、トークンが期限切れになったことを検出した場合、または xref:#quarkus-oidc-client_quarkus-oidc-client-refresh-token-time-skew[リフレッシュトークンの時間差] が設定されている場合は期限切れに近づいていると検出した場合に、現在のリクエスト中にトークンを更新します。パフォーマンスが重要なアプリケーションでは、受信リクエスト中にトークンの更新を待つことを避け、代わりに非同期トークン更新を設定したい場合があります。

source: By default, the OIDC client secret acts as the shared symmetric key, and can be configured with `quarkus.oidc.credentials.jwt.secret`. This is the same secret one can declare, for example, with the `quarkus.oidc.credentials.secret` property but having an option to define it in the `quarkus.oidc.credentials.jwt.*` namespace is better for the JWT `client_secret_jwt` authentication, as one may also need to customize the headers and claims added to JWT with setting more properties in the `quarkus.oidc.credentials.jwt.*` namespace, see the <<jwt-authentication-headers-claims>> section below for more details.
ja_jp: デフォルトでは、OIDC クライアントシークレットが共有対称鍵として機能し、 `quarkus.oidc.credentials.jwt.secret` で設定できます。これは、たとえば `quarkus.oidc.credentials.secret` プロパティーで宣言できるシークレットと同じですが、JWT `client_secret_jwt` 認証の場合、 `quarkus.oidc.credentials.jwt.*` 名前空間で定義するオプションがある方が適しています。 `quarkus.oidc.credentials.jwt.*` 名前空間でより多くのプロパティーを設定することで、JWT に追加されるヘッダーやクレームをカスタマイズする必要がある場合があるからです。詳細は以下の <<jwt-authentication-headers-claims>> セクションを参照してください。

source: By default, the OpenTelemetry extension enables the https://www.w3.org/TR/trace-context/[W3C Trace Context] and the https://www.w3.org/TR/baggage/[W3C Baggage] propagators, you can however choose any of the supported OpenTelemetry propagators by setting the `propagators` config that is described in the <<configuration-reference>>.
ja_jp: デフォルトでは、OpenTelemetryエクステンションは、link:https://www.w3.org/TR/trace-context/[W3C Trace Context]と link:https://www.w3.org/TR/baggage/[W3C Baggage] プロパゲーターを有効にしていますが、<<configuration-reference>> で説明されている `propagators` 設定を行うことで、サポートされているOpenTelemetryプロパゲーターのいずれかを選択できます。

source: By default, the OpenTelemetry extension enables the https://www.w3.org/TR/trace-context/[W3C Trace Context] and the https://www.w3.org/TR/baggage/[W3C Baggage] propagators, you can however choose any of the supported OpenTelemetry propagators by setting the `propagators` config that is described in the xref:configuration-reference[OpenTelemetry Configuration Reference].
ja_jp: デフォルトでは、OpenTelemetryエクステンションは link:https://www.w3.org/TR/trace-context/[W3C Trace Context] と link:https://www.w3.org/TR/baggage/[W3C Baggage] プロパゲーターを有効にしますが、OpenTelemetry xref:configuration-reference[設定リファレンス] で説明されている `propagators` 設定を設定すれば、サポートされているOpenTelemetryプロパゲータのどれかを選択することができます。

source: By default, the Pulsar consumer does not wait for the acknowledgement confirmation from the broker to validate an acknowledgement. You can enable this using `ackReceiptEnabled=true`.
ja_jp: デフォルトでは、Pulsar コンシューマーは、ブローカーからの確認応答の確認を待たずに確認応答を検証します。 `ackReceiptEnabled=true` を使用してこれを有効にできます。

source: By default, the Pulsar producer batches individual messages together to be published to the broker. You can configure batching parameters using `batchingMaxPublishDelayMicros`, `batchingPartitionSwitchFrequencyByPublishDelay`, `batchingMaxMessages`, `batchingMaxBytes` configuration properties, or disable it completely with `batchingEnabled=false`.
ja_jp: デフォルトでは、Pulsar プロデューサーは個々のメッセージをまとめてバッチ処理し、ブローカーに公開します。 バッチ処理のパラメーターは、 `batchingMaxPublishDelayMicros`、 `batchingPartitionSwitchFrequencyByPublishDelay`、 `batchingMaxMessages`、 `batchingMaxBytes` 設定プロパティーを使用して設定できます。 `batchingEnabled=false` で完全に無効にすることもできます。

source: By default, the Quarkus Maven resolver is reading project's POMs directly when discovering the project's layout. While in most cases it works well enough and relatively fast, reading raw POMs has its limitation. E.g. if a POM includes modules in a profile, these modules will not be discovered. This system property enables project's layout discovery based on the effective POM models, that are properly interpolated, instead of the raw ones. The reason this option is not enabled by default is it may appear to be significantly more time consuming that could increase, e.g. CI testing times. Until there is a better approach found that could be used by default, projects that require it should enable this option.
ja_jp: デフォルトでは、Quarkus Maven リゾルバーは、プロジェクトのレイアウトを検出するときにプロジェクトの POM を直接読み取ります。ほとんどの場合、これは十分に機能し、比較的高速ですが、raw POM を読み取ることには限界があります。たとえば、POM のプロファイルにモジュールが含まれている場合、これらのモジュールは検出されません。このシステムプロパティーにより、raw のモデルではなく、適切に補間された効果的な POM モデルに基づいたプロジェクトのレイアウト検出が可能になります。このオプションがデフォルトで有効になっていない理由は、たとえば CI テスト時間を増加させるなど、大幅に時間がかかると思われるからです。デフォルトで使用できるより良いアプローチが見つかるまで、このオプションが必要なプロジェクトは、これを有効にする必要があります。

source: By default, the Quarkus Maven resolver is reading project's POMs directly when discovering the project's layout. While in most cases it works well enough and relatively fast, reading raw POMs has its limitation. E.g. if a POM includes modules in a profile, these modules will not be discovered. This system property enables project's layout discovery based on the effective POM models, that are properly interpolated, instead of the raw ones. The reason this option is not enabled by default is it may appear to be significantly more time-consuming that could increase, e.g. CI testing times. Until there is a better approach found that could be used by default, projects that require it should enable this option.
ja_jp: デフォルトでは、Quarkus Maven リゾルバーは、プロジェクトのレイアウトを検出するときにプロジェクトの POM を直接読み取ります。ほとんどの場合、これは十分に機能し、比較的高速ですが、raw POM を読み取ることには限界があります。たとえば、POM のプロファイルにモジュールが含まれている場合、これらのモジュールは検出されません。このシステムプロパティーにより、raw のモデルではなく、適切に補間された効果的な POM モデルに基づいたプロジェクトのレイアウト検出が可能になります。このオプションがデフォルトで有効になっていない理由は、たとえば CI テスト時間を増加させるなど、大幅に時間がかかると思われるからです。デフォルトで使用できるより良いアプローチが見つかるまで、このオプションが必要なプロジェクトは、これを有効にする必要があります。

source: By default, the Quarkus gRPC extension invokes service methods on an event-loop thread. See the xref:quarkus-reactive-architecture.adoc[Quarkus Reactive Architecture documentation] for further details on this topic. But, you can also use the link:{blocking_annotation}[@Blocking] annotation to indicate that the service is _blocking_ and should be run on a worker thread.
ja_jp: デフォルトでは、Quarkus gRPC エクステンションはイベントループスレッドでサービスメソッドを呼び出します。 このトピックの詳細は、xref:quarkus-reactive-architecture.adoc[Quarkus リアクティブアーキテクチャーのドキュメント] を参照してください。 ただし、link:{blocking_annotation}[@Blocking] アノテーションを使用して、サービスが _ブロッキング状態_ であり、ワーカースレッドで実行する必要があることを示すこともできます。

source: By default, the Reactive Messaging `Message` is acknowledged when the broker acknowledged the message. When using routers, this acknowledgement may not be enabled. In this case, configure the `auto-acknowledgement` attribute to acknowledge the message as soon as it has been sent to the router.
ja_jp: デフォルトでは、ブローカーがメッセージを確認したときに、リアクティブメッセージングの `Message` が確認されます。ルーターを使用する場合、この確認応答が有効にならない場合があります。この場合、メッセージがルーターに送信されるとすぐにメッセージを確認するように、 `auto-acknowledgement` 属性を設定します。

source: By default, the Reactive Messaging `Message` is acknowledged when the broker acknowledges the message.
ja_jp: デフォルトでは、ブローカーがメッセージを確認すると、リアクティブメッセージングの `Message` が確認されます。

source: By default, the Reactive Messaging `Message` is acknowledged when the broker acknowledges the message. When using routers, this acknowledgement may not be enabled. In this case, configure the `auto-acknowledgement` attribute to acknowledge the message as soon as it has been sent to the router.
ja_jp: デフォルトでは、 Reactive Messaging の `Message` は、ブローカーがメッセージを確認したときに確認応答 (ack) されます。ルーターを使用している場合、この確認応答が有効にならないことがあります。その場合は、 `auto-acknowledgement` 属性を設定して、ルーターに送信された直後にメッセージを確認応答するようにしてください。

source: By default, the Red Panda broker does not act as a transaction coordinator. To enable transactions, set:
ja_jp: デフォルトでは、Red Pandaブローカーは、トランザクションコーディネーターとしては機能しません。トランザクションを有効にするには、次を設定します。

source: By default, the Red Panda broker is configured to enable transactions and idempotence features. You can disable those using:
ja_jp: デフォルトではRed Pandaブローカーはトランザクションとべき等を有効化するように設定されています。 以下の設定でそれらを無効にすることができます:

source: By default, the Redis backend stores the entry using the following keys pattern: `cache:{cache-name}:{cache-key}`, where `cache-key` is the key the application uses and `cache:{cache-name}` the prefix. The variable `{cache-name}` is resolved from the value set in the cache annotations. So, you can find all the entries for a single cache using the Redis `KEYS` command: `KEYS cache:{cache-name}:*`
ja_jp: デフォルトでは、Redisバックエンドは以下のキーパターンを使用してエントリを保存します： `cache:{cache-name}:{cache-key}` 。ここで、 `cache-key` はアプリケーションが使用するキーで、 `cache:{cache-name}` はプレフィックスです。 変数 `{cache-name}` はキャッシュアノテーションで設定された値から解決されます。そのため、Redis `KEYS` コマンドを使用すると、単一のキャッシュのすべてのエントリを見つけることができます： `KEYS cache:{cache-name}:*`

source: By default, the Redis backend stores the entry using the following keys: `cache:$cache-name:$cache-key`, where `cache-key` is the key the application uses. So, you can find all the entries for a single cache using the Redis `KEYS` command: `KEYS cache:$cache-name:*`
ja_jp: デフォルトでは、Redisバックエンドは以下のキーを使用してエントリーを保存します： `cache:$cache-name:$cache-key` 。ここで、 `cache-key` はアプリケーションが使用するキーです。そのため、Redis `KEYS` コマンドを使用すると、1 つのキャッシュのすべてのエントリーを見つけることができます： `KEYS cache:$cache-name:*`

source: By default, the Redpanda broker is configured to enable transactions and idempotence features. You can disable those using:
ja_jp: デフォルトではRedpanda ブローカーはトランザクションと冪等機能を有効化するように設定されています。 以下の設定でそれらを無効にすることができます:

source: By default, the `@InjectMock` annotation can be used for any normal CDI scoped bean (e.g. `@ApplicationScoped`, `@RequestScoped`). Mocking `@Singleton` beans can be performed by adding the `@MockitoConfig(convertScopes = true)` annotation. This will convert the `@Singleton` bean to an `@ApplicationScoped` bean for the test.
ja_jp: デフォルトでは、 `@InjectMock` アノテーションは、通常の CDI スコープ Bean (例: `@ApplicationScoped`、 `@RequestScoped`) に使用できます。 `@Singleton` Bean のモック化は、 `@MockitoConfig(convertScopes = true)` アノテーションを追加することで実行できます。 これにより、テストのために `@Singleton` Bean が `@ApplicationScoped` Bean に変換されます。

source: By default, the `@InjectMock` annotation can be used for any normal CDI scoped bean (e.g. `@ApplicationScoped`, `@RequestScoped`). Mocking `@Singleton` beans can be performed by setting the `convertScopes` property to true (such as `@InjectMock(convertScopes = true`). This will convert the `@Singleton` bean to an `@ApplicationScoped` bean for the test.
ja_jp: デフォルトでは、 `@InjectMock` アノテーションは、通常の CDI スコープ Bean (`@ApplicationScoped`、 `@RequestScoped` など) に使用できます。 `@Singleton` Bean のモックは、 `convertScopes` プロパティーを true に設定することで実行できます (`@InjectMock (convertScopes = true` など)。これにより、 `@Singleton` Bean がテスト用の `@ApplicationScoped` Bean に変換されます。.

source: By default, the `@QuarkusMain` with no name (i.e. the empty string) will be used, and if it is not present and `quarkus.package.main-class` is not specified then Quarkus will automatically generate a main class that just runs the application.
ja_jp: デフォルトでは、名前のない（つまり空の文字列） `@QuarkusMain` が使用されます。もしこれが存在せず、 `quarkus.package.main-class` も指定されていなければ、Quarkusは自動的にアプリケーションを動かすだけのメインクラスを生成します。

source: By default, the `JsonbSerializer` serializes null as the `"null"` String, this can be customized by setting the Kafka configuration property `json.serialize.null-as-null=true` which will serialize null as `null`. This is handy when using a compacted topic, as `null` is used as a tombstone to know which messages delete during compaction phase.
ja_jp: デフォルトでは、 `JsonbSerializer` は null を `"null"` 文字列としてシリアライズします。これは、null を `null` としてシリアライズする Kafka 設定プロパティー `json.serialize.null-as-null=true` を設定することでカスタマイズできます。これは、圧縮されたトピックを使用する場合に便利です。なぜなら、 `null` は、圧縮フェーズで削除されるメッセージを知るためのトゥームストーンとし使用されるからです。

source: By default, the `ObjectMapperSerializer` serializes null as the `"null"` String, this can be customized by setting the Kafka configuration property `json.serialize.null-as-null=true` which will serialize null as `null`. This is handy when using a compacted topic, as `null` is used as a tombstone to know which messages delete during compaction phase.
ja_jp: デフォルトでは、 `ObjectMapperSerializer` は null を `"null"` 文字列としてシリアライズします。これは、null を `null` としてシリアライズする Kafka 設定プロパティー `json.serialize.null-as-null=true` を設定することでカスタマイズできます。これは、圧縮されたトピックを使用する場合に便利です。なぜなら、 `null` は、圧縮フェーズで削除されるメッセージを知るためのトゥームストーンとし使用されるからです。

source: By default, the `Server` log (standard Quarkus log output) is selected, but additional log tabs may appear depending on which extensions are present. For example:
ja_jp: デフォルトでは、 `Server` ログ (標準の Quarkus ログ出力) が選択されますが、どのエクステンションが存在するかによって、追加のログタブが表示される場合があります。例えば、

source: By default, the `groupId`, `version`, `quarkusVersion`, `namespaceId`, and `namespaceName` will be consistent with other Quarkus core extensions.
ja_jp: デフォルトでは、 `groupId`, `version`, `quarkusVersion`, `namespaceId`, `namespaceName` は、他のQuarkusコアエクステンションと一致します。

source: By default, the `iss` claim value is compared to the `issuer` property which may have been discovered in the well-known provider configuration. But if `quarkus.oidc.token.issuer` property is set then the `iss` claim value is compared to it instead.
ja_jp: デフォルトでは、 `iss` クレーム値は、well-knownプロバイダの設定で発見された `issuer` プロパティと比較されます。しかし、 `quarkus.oidc.token.issuer` プロパティが設定されている場合は、代わりに `iss` クレーム値がそれと比較されます。

source: By default, the `iss` claim value is compared to the `issuer` property, which might have been discovered in the well-known provider configuration. However, if the `quarkus.oidc.token.issuer` property is set, then the `iss` claim value is compared to it instead.
ja_jp: デフォルトでは、 `iss` クレーム値は、既知のプロバイダー設定で検出された `issuer` プロパティーと比較されます。 ただし、 `quarkus.oidc.token.issuer` プロパティーが設定されている場合は、代わりにそのプロパティーと `iss` クレーム値が比較されます。

source: By default, the `native-test` source set is based on `main` and `test` source sets. It is possible to add an extra source set. For example, if your integration tests are located in an `integrationTest` source set, you can specify it as:
ja_jp: デフォルトでは、 `native-test` のソースセットは、 `main` と `test` のソースセットに基づいています。ソースセットを追加することも可能です。たとえば、統合テストが `integrationTest` のソースセットにある場合は、次のように指定します。

source: By default, the `quarkus-grpc` extension relies on the reactive programming model. In this guide we will follow a reactive approach. Under the `dependencies` section of your `pom.xml` file, make sure you have the Quarkus REST (formerly RESTEasy Reactive) dependency:
ja_jp: デフォルトでは、 `quarkus-grpc` エクステンションはリアクティブ・プログラミング・モデルに依存しています。 このガイドでは、リアクティブアプローチに従います。 `pom.xml` ファイルの `dependencies` セクションで、Quarkus REST（旧 RESTEasy Reactive）の依存関係があるようにして下さい:

source: By default, the `quarkus-grpc` extension relies on the reactive programming model. In this guide we will follow a reactive approach. Under the `dependencies` section of your `pom.xml` file, make sure you have the RESTEasy Reactive dependency:
ja_jp: デフォルトでは、 `quarkus-grpc` エクステンションはリアクティブなプログラミングモデルに依存しています。本ガイドではリアクティブなアプローチを採用します。 `pom.xml` ファイルの `dependencies` セクションで、 RESTEasy Reactiveの依存関係を確認してください。

source: By default, the `quarkusDev` task uses `compileJava` compiler options. These can be overridden by setting the `compilerArgs` property in the task.
ja_jp: デフォルトでは、 `quarkusDev` タスクは `compileJava` コンパイラ・オプションを使用します。これらは、タスクの `compilerArgs` プロパティーを設定することで上書きすることができます。

source: By default, the `quarkus` and `quarkus-app` client with a `secret` password, `alice` and `bob` users (with the passwords matching the names), and `user` and `admin` roles are created, with `alice` given both `admin` and `user` roles and `bob` - the `user` role.
ja_jp: デフォルトでは、パスワードが `secret` の `quarkus` および `quarkus-app` クライアント、`alice` および `bob` ユーザー (パスワードは名前と同じ)、`user` および `admin` ロールが作成されます。このとき、`alice` には `admin` と `user` の両方のロールが与えられ、`bob` には `user` ロールが与えられます。

source: By default, the `quarkus`, `quarkus-app` client with a `secret` password, `alice` and `bob` users (with the passwords matching the names), and `user` and `admin` roles are created, with `alice` given both `admin` and `user` roles and `bob` - the `user` role.
ja_jp: デフォルトでは、 `quarkus`、 `secret` パスワードを持つ `quarkus-app` クライアント、 `alice` および `bob` ユーザー (名前と一致するパスワードを持つ)、 `user` および `admin` ロールが作成されます。このとき、 `alice` には `admin` と `user` の両方のロールが与えられ、 `bob` には `user` のロールが与えられます。

source: By default, the `wait-for` image is `groundnuty/k8s-wait-for:no-root-v1.7`. You can define another image:
ja_jp: デフォルトでは、 `wait-for` のイメージは `groundnuty/k8s-wait-for:no-root-v1.7` です。別のイメージを定義することもできます：

source: By default, the application tries to connect to a Kafka broker listening at `localhost:9092`. You can configure the bootstrap server using: `java -Dkafka.bootstrap.servers=\... -jar target/quarkus-app/quarkus-run.jar`
ja_jp: デフォルトでは、アプリケーションは `localhost:9092` でリッスンしている Kafka ブローカーに接続しようとします。ブートストラップサーバーは、`java -Dkafka.bootstrap.servers=\... -jar target/quarkus-app/quarkus-run.jar` を使用して設定できます。

source: By default, the assistant is disabled until configured. You can choose from supported AI providers:
ja_jp: デフォルトでは、アシスタントは設定されるまで無効になっています。サポートされている AI プロバイダーから選択できます:

source: By default, the authentication security constraints are enforced before the JAX-RS chain starts. Disabling the proactive authentication effectively shifts this process to the moment when the JAX-RS chain starts running thus making it possible to use JAX-RS `ExceptionMapper` to capture Quarkus Security authentication exceptions such as `io.quarkus.security.AuthenticationFailedException`, for example:
ja_jp: デフォルトでは、認証セキュリティ制約は、JAX-RSチェーンが開始される前に実施されます。プロアクティブ認証を無効にすると、このプロセスがJAX-RSチェーンの実行開始時に効果的に移行されるため、JAX-RS `ExceptionMapper` を使用して、例えば `io.quarkus.security.AuthenticationFailedException` などのQuarkus Security認証の例外を取得することが可能になります。 :

source: By default, the client will support keys and values of the following types: byte[], primitive wrappers (e.g. Integer, Long, Double), String, Date and Instant. User types require some additional steps that are detailed here. Let's say we have the following user classes:
ja_jp: デフォルトでは、クライアントは以下の型のキーとバリューをサポートします: byte[]、プリミティブラッパー(例: Integer、Long、Doubleなど)、String、Date、Instant。ユーザ型については、ここで詳しく説明される追加のステップが必要です。以下のようなユーザクラスがあるとします:
